<?
Число с массива:	string(1) "0"
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(1) "1"
abs:				string(1) "1"
ToString:			string(1) "1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(3) "1.1"
abs:				string(3) "1.1"
ToString:			string(3) "1.1"
Целая часть:		string(1) "1"
Десятичная часть:	string(1) "1"
Десятичный разряд:	string(2) "10"
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(3) "1.0"
abs:				string(1) "1"
ToString:			string(1) "1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(2) "01"
abs:				string(1) "1"
ToString:			string(1) "1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(4) "1000"
abs:				string(4) "1000"
ToString:			string(4) "1000"
Целая часть:		string(4) "1000"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(6) "01.010"
abs:				string(4) "1.01"
ToString:			string(4) "1.01"
Целая часть:		string(1) "1"
Десятичная часть:	string(2) "01"
Десятичный разряд:	string(3) "100"
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(5) "10.10"
abs:				string(4) "10.1"
ToString:			string(4) "10.1"
Целая часть:		string(2) "10"
Десятичная часть:	string(1) "1"
Десятичный разряд:	string(2) "10"
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(7) "000.000"
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(3) "0.0"
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(4) "0e+1"
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(4) "0E-1"
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(3) "1e2"
abs:				string(3) "100"
ToString:			string(3) "100"
Целая часть:		string(3) "100"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(4) "1e-2"
abs:				string(4) "0.01"
ToString:			string(4) "0.01"
Целая часть:		string(1) "0"
Десятичная часть:	string(2) "01"
Десятичный разряд:	string(3) "100"
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(3) "1E0"
abs:				string(1) "1"
ToString:			string(1) "1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(6) "001E+3"
abs:				string(4) "1000"
ToString:			string(4) "1000"
Целая часть:		string(4) "1000"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(6) "001e-3"
abs:				string(5) "0.001"
ToString:			string(5) "0.001"
Целая часть:		string(1) "0"
Десятичная часть:	string(3) "001"
Десятичный разряд:	string(4) "1000"
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(11) "001.00100e0"
abs:				string(5) "1.001"
ToString:			string(5) "1.001"
Целая часть:		string(1) "1"
Десятичная часть:	string(3) "001"
Десятичный разряд:	string(4) "1000"
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(6) "0.1e+1"
abs:				string(1) "1"
ToString:			string(1) "1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(6) "1.0e-2"
abs:				string(4) "0.01"
ToString:			string(4) "0.01"
Целая часть:		string(1) "0"
Десятичная часть:	string(2) "01"
Десятичный разряд:	string(3) "100"
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(6) "0.0e-2"
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(17) "00100.00100100e-2"
abs:				string(10) "1.00001001"
ToString:			string(10) "1.00001001"
Целая часть:		string(1) "1"
Десятичная часть:	string(8) "00001001"
Десятичный разряд:	string(9) "100000000"
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(16) "00100.00100100e2"
abs:				string(10) "10000.1001"
ToString:			string(10) "10000.1001"
Целая часть:		string(5) "10000"
Десятичная часть:	string(4) "1001"
Десятичный разряд:	string(5) "10000"
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(4) "0e+0"
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(3) "0e0"
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(4) "0E-0"
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(9) "10.000e-1"
abs:				string(1) "1"
ToString:			string(1) "1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(8) "10.000E0"
abs:				string(2) "10"
ToString:			string(2) "10"
Целая часть:		string(2) "10"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	int(0)
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	int(1)
abs:				string(1) "1"
ToString:			string(1) "1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(1.1)
abs:				string(3) "1.1"
ToString:			string(3) "1.1"
Целая часть:		string(1) "1"
Десятичная часть:	string(1) "1"
Десятичный разряд:	string(2) "10"
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(1)
abs:				string(1) "1"
ToString:			string(1) "1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	int(1)
abs:				string(1) "1"
ToString:			string(1) "1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(1.01)
abs:				string(4) "1.01"
ToString:			string(4) "1.01"
Целая часть:		string(1) "1"
Десятичная часть:	string(2) "01"
Десятичный разряд:	string(3) "100"
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(10.1)
abs:				string(4) "10.1"
ToString:			string(4) "10.1"
Целая часть:		string(2) "10"
Десятичная часть:	string(1) "1"
Десятичный разряд:	string(2) "10"
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(0)
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(0)
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(0)
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(0)
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(100)
abs:				string(3) "100"
ToString:			string(3) "100"
Целая часть:		string(3) "100"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(0.01)
abs:				string(4) "0.01"
ToString:			string(4) "0.01"
Целая часть:		string(1) "0"
Десятичная часть:	string(2) "01"
Десятичный разряд:	string(3) "100"
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(1)
abs:				string(1) "1"
ToString:			string(1) "1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(1000)
abs:				string(4) "1000"
ToString:			string(4) "1000"
Целая часть:		string(4) "1000"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(0.001)
abs:				string(5) "0.001"
ToString:			string(5) "0.001"
Целая часть:		string(1) "0"
Десятичная часть:	string(3) "001"
Десятичный разряд:	string(4) "1000"
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(1.001)
abs:				string(5) "1.001"
ToString:			string(5) "1.001"
Целая часть:		string(1) "1"
Десятичная часть:	string(3) "001"
Десятичный разряд:	string(4) "1000"
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(1)
abs:				string(1) "1"
ToString:			string(1) "1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(0.01)
abs:				string(4) "0.01"
ToString:			string(4) "0.01"
Целая часть:		string(1) "0"
Десятичная часть:	string(2) "01"
Десятичный разряд:	string(3) "100"
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(0)
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(1.00001001)
abs:				string(10) "1.00001001"
ToString:			string(10) "1.00001001"
Целая часть:		string(1) "1"
Десятичная часть:	string(8) "00001001"
Десятичный разряд:	string(9) "100000000"
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(10000.1001)
abs:				string(10) "10000.1001"
ToString:			string(10) "10000.1001"
Целая часть:		string(5) "10000"
Десятичная часть:	string(4) "1001"
Десятичный разряд:	string(5) "10000"
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(0)
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(0)
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(0)
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(1)
abs:				string(1) "1"
ToString:			string(1) "1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------
Число с массива:	string(2) "-0"
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(2) "-1"
abs:				string(1) "1"
ToString:			string(2) "-1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(4) "-1.1"
abs:				string(3) "1.1"
ToString:			string(4) "-1.1"
Целая часть:		string(1) "1"
Десятичная часть:	string(1) "1"
Десятичный разряд:	string(2) "10"
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(4) "-1.0"
abs:				string(1) "1"
ToString:			string(2) "-1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(3) "-01"
abs:				string(1) "1"
ToString:			string(2) "-1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(7) "-01.010"
abs:				string(4) "1.01"
ToString:			string(5) "-1.01"
Целая часть:		string(1) "1"
Десятичная часть:	string(2) "01"
Десятичный разряд:	string(3) "100"
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(6) "-10.10"
abs:				string(4) "10.1"
ToString:			string(5) "-10.1"
Целая часть:		string(2) "10"
Десятичная часть:	string(1) "1"
Десятичный разряд:	string(2) "10"
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(8) "-000.000"
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(4) "-0.0"
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(5) "-0e+1"
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(5) "-0E-1"
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(4) "-1e2"
abs:				string(3) "100"
ToString:			string(4) "-100"
Целая часть:		string(3) "100"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(5) "-1e-2"
abs:				string(4) "0.01"
ToString:			string(5) "-0.01"
Целая часть:		string(1) "0"
Десятичная часть:	string(2) "01"
Десятичный разряд:	string(3) "100"
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(4) "-1E0"
abs:				string(1) "1"
ToString:			string(2) "-1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(7) "-001E+3"
abs:				string(4) "1000"
ToString:			string(5) "-1000"
Целая часть:		string(4) "1000"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(7) "-001e-3"
abs:				string(5) "0.001"
ToString:			string(6) "-0.001"
Целая часть:		string(1) "0"
Десятичная часть:	string(3) "001"
Десятичный разряд:	string(4) "1000"
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(12) "-001.00100e0"
abs:				string(5) "1.001"
ToString:			string(6) "-1.001"
Целая часть:		string(1) "1"
Десятичная часть:	string(3) "001"
Десятичный разряд:	string(4) "1000"
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(7) "-0.1e+1"
abs:				string(1) "1"
ToString:			string(2) "-1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(7) "-1.0e-2"
abs:				string(4) "0.01"
ToString:			string(5) "-0.01"
Целая часть:		string(1) "0"
Десятичная часть:	string(2) "01"
Десятичный разряд:	string(3) "100"
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(7) "-0.0e-2"
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(18) "-00100.00100100e-2"
abs:				string(10) "1.00001001"
ToString:			string(11) "-1.00001001"
Целая часть:		string(1) "1"
Десятичная часть:	string(8) "00001001"
Десятичный разряд:	string(9) "100000000"
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(17) "-00100.00100100e2"
abs:				string(10) "10000.1001"
ToString:			string(11) "-10000.1001"
Целая часть:		string(5) "10000"
Десятичная часть:	string(4) "1001"
Десятичный разряд:	string(5) "10000"
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(5) "-0e+0"
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(4) "-0e0"
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(5) "-0E-0"
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(10) "-10.000e-1"
abs:				string(1) "1"
ToString:			string(2) "-1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------
Число с массива:	string(10) "-10.000e-0"
abs:				string(2) "10"
ToString:			string(3) "-10"
Целая часть:		string(2) "10"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	int(0)
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	int(-1)
abs:				string(1) "1"
ToString:			string(2) "-1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(-1.1)
abs:				string(3) "1.1"
ToString:			string(4) "-1.1"
Целая часть:		string(1) "1"
Десятичная часть:	string(1) "1"
Десятичный разряд:	string(2) "10"
Отрицательное:		bool(true)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(-1)
abs:				string(1) "1"
ToString:			string(2) "-1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	int(-1)
abs:				string(1) "1"
ToString:			string(2) "-1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(-1.01)
abs:				string(4) "1.01"
ToString:			string(5) "-1.01"
Целая часть:		string(1) "1"
Десятичная часть:	string(2) "01"
Десятичный разряд:	string(3) "100"
Отрицательное:		bool(true)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(-10.1)
abs:				string(4) "10.1"
ToString:			string(5) "-10.1"
Целая часть:		string(2) "10"
Десятичная часть:	string(1) "1"
Десятичный разряд:	string(2) "10"
Отрицательное:		bool(true)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(0)
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(0)
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(0)
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(0)
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(-100)
abs:				string(3) "100"
ToString:			string(4) "-100"
Целая часть:		string(3) "100"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(-0.01)
abs:				string(4) "0.01"
ToString:			string(5) "-0.01"
Целая часть:		string(1) "0"
Десятичная часть:	string(2) "01"
Десятичный разряд:	string(3) "100"
Отрицательное:		bool(true)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(-1)
abs:				string(1) "1"
ToString:			string(2) "-1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(-1000)
abs:				string(4) "1000"
ToString:			string(5) "-1000"
Целая часть:		string(4) "1000"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(-0.001)
abs:				string(5) "0.001"
ToString:			string(6) "-0.001"
Целая часть:		string(1) "0"
Десятичная часть:	string(3) "001"
Десятичный разряд:	string(4) "1000"
Отрицательное:		bool(true)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(-1.001)
abs:				string(5) "1.001"
ToString:			string(6) "-1.001"
Целая часть:		string(1) "1"
Десятичная часть:	string(3) "001"
Десятичный разряд:	string(4) "1000"
Отрицательное:		bool(true)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(-1)
abs:				string(1) "1"
ToString:			string(2) "-1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(-0.01)
abs:				string(4) "0.01"
ToString:			string(5) "-0.01"
Целая часть:		string(1) "0"
Десятичная часть:	string(2) "01"
Десятичный разряд:	string(3) "100"
Отрицательное:		bool(true)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(0)
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(-1.00001001)
abs:				string(10) "1.00001001"
ToString:			string(11) "-1.00001001"
Целая часть:		string(1) "1"
Десятичная часть:	string(8) "00001001"
Десятичный разряд:	string(9) "100000000"
Отрицательное:		bool(true)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(-10000.1001)
abs:				string(10) "10000.1001"
ToString:			string(11) "-10000.1001"
Целая часть:		string(5) "10000"
Десятичная часть:	string(4) "1001"
Десятичный разряд:	string(5) "10000"
Отрицательное:		bool(true)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(0)
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(0)
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(0)
abs:				string(1) "0"
ToString:			string(1) "0"
Целая часть:		string(1) "0"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		NULL
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 175

Число с массива:	float(-1)
abs:				string(1) "1"
ToString:			string(2) "-1"
Целая часть:		string(1) "1"
Десятичная часть:	NULL
Десятичный разряд:	NULL
Отрицательное:		bool(true)
---------------------------------------------------------------------


Fatal error:  "Неверно задано значение для класса LAInit. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 183














Число с массива:	string(1) "0"
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(1) "1"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(3) "1.1"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(true)
eq 1 (str):		bool(true)
---------------------------------------------------------------------
Число с массива:	string(3) "1.0"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(2) "01"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(4) "1000"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(6) "01.010"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(5) "10.10"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(7) "000.000"
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(3) "0.0"
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(4) "0e+1"
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(4) "0E-1"
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(3) "1e2"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(4) "1e-2"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(3) "1E0"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(6) "001E+3"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(6) "001e-3"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(11) "001.00100e0"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(6) "0.1e+1"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(6) "1.0e-2"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(6) "0.0e-2"
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(17) "00100.00100100e-2"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(16) "00100.00100100e2"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(4) "0e+0"
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(3) "0e0"
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(4) "0E-0"
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(9) "10.000e-1"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(8) "10.000E0"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	int(0)
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	int(1)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(1.1)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(true)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(true)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(1)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	int(1)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(1.01)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(10.1)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(0)
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(0)
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(0)
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(0)
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(100)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(0.01)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(1)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(1000)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(0.001)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(1.001)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(1)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(0.01)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(0)
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(1.00001001)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(10000.1001)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(0)
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(0)
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(0)
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(1)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------
Число с массива:	string(2) "-0"
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(2) "-1"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(4) "-1.1"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(4) "-1.0"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(3) "-01"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(7) "-01.010"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(6) "-10.10"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(8) "-000.000"
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(4) "-0.0"
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(5) "-0e+1"
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(5) "-0E-1"
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(4) "-1e2"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(5) "-1e-2"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(4) "-1E0"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(7) "-001E+3"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(7) "-001e-3"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(12) "-001.00100e0"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(7) "-0.1e+1"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(7) "-1.0e-2"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(7) "-0.0e-2"
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(18) "-00100.00100100e-2"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(17) "-00100.00100100e2"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(5) "-0e+0"
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(4) "-0e0"
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(5) "-0E-0"
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(10) "-10.000e-1"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------
Число с массива:	string(10) "-10.000e-0"
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		bool(false)
eq 1 (str):		bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	int(0)
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	int(-1)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(-1.1)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(-1)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	int(-1)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(-1.01)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(-10.1)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(0)
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(0)
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(0)
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(0)
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(-100)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(-0.01)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(-1)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(-1000)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(-0.001)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(-1.001)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(-1)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(-0.01)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(0)
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(-1.00001001)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(-10000.1001)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(0)
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(0)
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(0)
eq 0 (obj):		bool(true)
eq 0 (str):		bool(true)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Warning:  "Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 174

Число с массива:	float(-1)
eq 0 (obj):		bool(false)
eq 0 (str):		bool(false)
eq 1 (obj):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
eq 1 (str):		

Warning:  "LAO::eq [параметр 1]: Возможна потеря данных. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 298

bool(false)
---------------------------------------------------------------------


Fatal error:  "Неверно задано значение для класса LAInit. Ожидается строка." in D:\Programms\OpenServer\OpenServer\domains\KPOCT.RU\kpoct\la.php on line 179











inc(0, -3) = 0.001
inc(1, -3) = 1.001
inc(5, -3) = 5.001
inc(49, -3) = 49.001
inc(0.5, -3) = 0.501
inc(5.5, -3) = 5.501
-------------------------------------------
inc(0, -2) = 0.01
inc(1, -2) = 1.01
inc(5, -2) = 5.01
inc(49, -2) = 49.01
inc(0.5, -2) = 0.51
inc(5.5, -2) = 5.51
-------------------------------------------
inc(0, -1) = 0.1
inc(1, -1) = 1.1
inc(5, -1) = 5.1
inc(49, -1) = 49.1
inc(0.5, -1) = 0.6
inc(5.5, -1) = 5.6
-------------------------------------------
inc(0, 0) = 1
inc(1, 0) = 2
inc(5, 0) = 6
inc(49, 0) = 50
inc(0.5, 0) = 1.5
inc(5.5, 0) = 6.5
-------------------------------------------
inc(0, 1) = 10
inc(1, 1) = 11
inc(5, 1) = 15
inc(49, 1) = 59
inc(0.5, 1) = 10.5
inc(5.5, 1) = 15.5
-------------------------------------------
inc(0, 2) = 100
inc(1, 2) = 101
inc(5, 2) = 105
inc(49, 2) = 149
inc(0.5, 2) = 100.5
inc(5.5, 2) = 105.5
-------------------------------------------
inc(0, 3) = 1000
inc(1, 3) = 1001
inc(5, 3) = 1005
inc(49, 3) = 1049
inc(0.5, 3) = 1000.5
inc(5.5, 3) = 1005.5
-------------------------------------------
inc(0, 4) = 10000
inc(1, 4) = 10001
inc(5, 4) = 10005
inc(49, 4) = 10049
inc(0.5, 4) = 10000.5
inc(5.5, 4) = 10005.5
-------------------------------------------




inc(0, -3) = 0.001
inc(-1, -3) = -0.999
inc(-5, -3) = -4.999
inc(-49, -3) = -48.999
inc(-0.5, -3) = -0.499
inc(-5.5, -3) = -5.499
-------------------------------------------
inc(0, -2) = 0.01
inc(-1, -2) = -0.99
inc(-5, -2) = -4.99
inc(-49, -2) = -48.99
inc(-0.5, -2) = -0.49
inc(-5.5, -2) = -5.49
-------------------------------------------
inc(0, -1) = 0.1
inc(-1, -1) = -0.9
inc(-5, -1) = -4.9
inc(-49, -1) = -48.9
inc(-0.5, -1) = -0.4
inc(-5.5, -1) = -5.4
-------------------------------------------
inc(0, 0) = 1
inc(-1, 0) = 0
inc(-5, 0) = -4
inc(-49, 0) = -48
inc(-0.5, 0) = 0.5
inc(-5.5, 0) = -4.5
-------------------------------------------
inc(0, 1) = 10
inc(-1, 1) = 9
inc(-5, 1) = 5
inc(-49, 1) = -39
inc(-0.5, 1) = 9.5
inc(-5.5, 1) = 4.5
-------------------------------------------
inc(0, 2) = 100
inc(-1, 2) = 99
inc(-5, 2) = 95
inc(-49, 2) = 51
inc(-0.5, 2) = 99.5
inc(-5.5, 2) = 94.5
-------------------------------------------
inc(0, 3) = 1000
inc(-1, 3) = 999
inc(-5, 3) = 995
inc(-49, 3) = 951
inc(-0.5, 3) = 999.5
inc(-5.5, 3) = 994.5
-------------------------------------------
inc(0, 4) = 10000
inc(-1, 4) = 9999
inc(-5, 4) = 9995
inc(-49, 4) = 9951
inc(-0.5, 4) = 9999.5
inc(-5.5, 4) = 9994.5
-------------------------------------------









dec(0, -3) = -0.001
dec(1, -3) = 0.999
dec(5, -3) = 4.999
dec(49, -3) = 48.999
dec(0.5, -3) = 0.499
dec(5.5, -3) = 5.499
-------------------------------------------
dec(0, -2) = -0.01
dec(1, -2) = 0.99
dec(5, -2) = 4.99
dec(49, -2) = 48.99
dec(0.5, -2) = 0.49
dec(5.5, -2) = 5.49
-------------------------------------------
dec(0, -1) = -0.1
dec(1, -1) = 0.9
dec(5, -1) = 4.9
dec(49, -1) = 48.9
dec(0.5, -1) = 0.4
dec(5.5, -1) = 5.4
-------------------------------------------
dec(0, 0) = -1
dec(1, 0) = 0
dec(5, 0) = 4
dec(49, 0) = 48
dec(0.5, 0) = -0.5
dec(5.5, 0) = 4.5
-------------------------------------------
dec(0, 1) = -10
dec(1, 1) = -9
dec(5, 1) = -5
dec(49, 1) = 39
dec(0.5, 1) = -9.5
dec(5.5, 1) = -4.5
-------------------------------------------
dec(0, 2) = -100
dec(1, 2) = -99
dec(5, 2) = -95
dec(49, 2) = -51
dec(0.5, 2) = -99.5
dec(5.5, 2) = -94.5
-------------------------------------------
dec(0, 3) = -1000
dec(1, 3) = -999
dec(5, 3) = -995
dec(49, 3) = -951
dec(0.5, 3) = -999.5
dec(5.5, 3) = -994.5
-------------------------------------------
dec(0, 4) = -10000
dec(1, 4) = -9999
dec(5, 4) = -9995
dec(49, 4) = -9951
dec(0.5, 4) = -9999.5
dec(5.5, 4) = -9994.5
-------------------------------------------







dec(0, -3) = -0.001
dec(-1, -3) = -1.001
dec(-5, -3) = -5.001
dec(-49, -3) = -49.001
dec(-0.5, -3) = -0.501
dec(-5.5, -3) = -5.501
-------------------------------------------
dec(0, -2) = -0.01
dec(-1, -2) = -1.01
dec(-5, -2) = -5.01
dec(-49, -2) = -49.01
dec(-0.5, -2) = -0.51
dec(-5.5, -2) = -5.51
-------------------------------------------
dec(0, -1) = -0.1
dec(-1, -1) = -1.1
dec(-5, -1) = -5.1
dec(-49, -1) = -49.1
dec(-0.5, -1) = -0.6
dec(-5.5, -1) = -5.6
-------------------------------------------
dec(0, 0) = -1
dec(-1, 0) = -2
dec(-5, 0) = -6
dec(-49, 0) = -50
dec(-0.5, 0) = -1.5
dec(-5.5, 0) = -6.5
-------------------------------------------
dec(0, 1) = -10
dec(-1, 1) = -11
dec(-5, 1) = -15
dec(-49, 1) = -59
dec(-0.5, 1) = -10.5
dec(-5.5, 1) = -15.5
-------------------------------------------
dec(0, 2) = -100
dec(-1, 2) = -101
dec(-5, 2) = -105
dec(-49, 2) = -149
dec(-0.5, 2) = -100.5
dec(-5.5, 2) = -105.5
-------------------------------------------
dec(0, 3) = -1000
dec(-1, 3) = -1001
dec(-5, 3) = -1005
dec(-49, 3) = -1049
dec(-0.5, 3) = -1000.5
dec(-5.5, 3) = -1005.5
-------------------------------------------
dec(0, 4) = -10000
dec(-1, 4) = -10001
dec(-5, 4) = -10005
dec(-49, 4) = -10049
dec(-0.5, 4) = -10000.5
dec(-5.5, 4) = -10005.5
-------------------------------------------




$a = new LAInit( '59' );
$b = new LAInit( '-79.99' );
$c = new LAInit( '-62.7' );
$d = new LAInit( '49' );

echo $a->ToString() . ' + ' . $a->ToString() . ' = ' . LAO::sum( $a, $a)->ToString() . PHP_EOL;
echo $a->ToString() . ' + ' . $b->ToString() . ' = ' . LAO::sum( $a, $b)->ToString() . PHP_EOL;
echo $a->ToString() . ' + ' . $c->ToString() . ' = ' . LAO::sum( $a, $c)->ToString() . PHP_EOL;
echo $a->ToString() . ' + ' . $d->ToString() . ' = ' . LAO::sum( $a, $d)->ToString() . PHP_EOL;
echo $b->ToString() . ' + ' . $a->ToString() . ' = ' . LAO::sum( $b, $a)->ToString() . PHP_EOL;
echo $b->ToString() . ' + ' . $b->ToString() . ' = ' . LAO::sum( $b, $b)->ToString() . PHP_EOL;
echo $b->ToString() . ' + ' . $c->ToString() . ' = ' . LAO::sum( $b, $c)->ToString() . PHP_EOL;
echo $b->ToString() . ' + ' . $d->ToString() . ' = ' . LAO::sum( $b, $d)->ToString() . PHP_EOL;
echo $c->ToString() . ' + ' . $a->ToString() . ' = ' . LAO::sum( $c, $a)->ToString() . PHP_EOL;
echo $c->ToString() . ' + ' . $b->ToString() . ' = ' . LAO::sum( $c, $b)->ToString() . PHP_EOL;
echo $c->ToString() . ' + ' . $c->ToString() . ' = ' . LAO::sum( $c, $c)->ToString() . PHP_EOL;
echo $c->ToString() . ' + ' . $d->ToString() . ' = ' . LAO::sum( $c, $d)->ToString() . PHP_EOL;
echo $d->ToString() . ' + ' . $a->ToString() . ' = ' . LAO::sum( $d, $a)->ToString() . PHP_EOL;
echo $d->ToString() . ' + ' . $b->ToString() . ' = ' . LAO::sum( $d, $b)->ToString() . PHP_EOL;
echo $d->ToString() . ' + ' . $c->ToString() . ' = ' . LAO::sum( $d, $c)->ToString() . PHP_EOL;
echo $d->ToString() . ' + ' . $d->ToString() . ' = ' . LAO::sum( $d, $d)->ToString();

59 + 59 = 118
59 + -79.99 = -20.99
59 + -62.7 = -3.7
59 + 49 = 108
-79.99 + 59 = -20.99
-79.99 + -79.99 = -159.98
-79.99 + -62.7 = -142.69
-79.99 + 49 = -30.99
-62.7 + 59 = -3.7
-62.7 + -79.99 = -142.69
-62.7 + -62.7 = -125.4
-62.7 + 49 = -13.7
49 + 59 = 108
49 + -79.99 = -30.99
49 + -62.7 = -13.7
49 + 49 = 98

59 - 59 = 0
59 - -79.99 = 138.99
59 - -62.7 = 121.7
59 - 49 = 10
-79.99 - 59 = -138.99
-79.99 - -79.99 = 159.98
-79.99 - -62.7 = 142.69
-79.99 - 49 = -128.99
-62.7 - 59 = -121.7
-62.7 - -79.99 = 142.69
-62.7 - -62.7 = 125.4
-62.7 - 49 = -111.7
49 - 59 = -10
49 - -79.99 = 128.99
49 - -62.7 = 111.7
49 - 49 = 0









1000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
-
1000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
=
0



1000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
-
0.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000002
=
999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999.999999999999999999999999999999999999999999999999999999999999999999999999999999999999999998



1000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
-
-0.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001
=
1000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001



1000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
-
-2000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
=
3000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000



0.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000002
-
1000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
=
-999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999.999999999999999999999999999999999999999999999999999999999999999999999999999999999999999998



0.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000002
-
0.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000002
=
0



0.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000002
-
-0.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001
=
0.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000003



0.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000002
-
-2000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
=
2000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000002



-0.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001
-
1000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
=
-1000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001



-0.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001
-
0.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000002
=
-0.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000003



-0.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001
-
-0.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001
=
0.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000002



-0.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001
-
-2000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
=
2000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001



-2000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
-
1000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
=
-3000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000



-2000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
-
0.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000002
=
-2000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000002



-2000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
-
-0.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001
=
2000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001



-2000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
-
-2000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
=
4000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000